var data = [];
var dataStr = '1、白云<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
2、白云蓝天<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
3、草<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
4、草莓<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
5、垂钓<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
6、猫咪<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
7、妹纸<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
8、沙拉<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
9、树<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
10、树木<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
11、台球<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
12、天空<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
13、溪沸<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
14、烟花<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
15、风筝<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
<br>\
<br>\
16、绿树<br>\
<br>\
·暂无图片介绍。等待黄豆豆童鞋给我们讲这个故事吧。<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    //console.log(c[0].replace('、', ' ') + '.jpg');
};